Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep the cross section curve along a path guided by a two rails
path:  The input path to sweep along.
guideRail:  A rail to guide the orientation of the sweep.
profile:
Returns:
sweep2,guides