Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep a closed profile Curve along two rail Curves.
path:  The input path to sweep along.
guideRail:  A rail to guide the orientation of the sweep.
profile:
Returns:
Brep,brep,sweep2,guides,sweepprofile